In [1]:
import pandas as pd
import numpy as np

In [2]:
#creating a series from python list
colors = pd.Series(['Red', 'Green', 'Blue'])
colors

0      Red
1    Green
2     Blue
dtype: object

In [3]:
colors.values

array(['Red', 'Green', 'Blue'], dtype=object)

In [4]:
colors.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
#assigning own indexes
fruits = pd.Series(['Red', 'Green', 'Orange', 'Blue'], index = ['Apple', 'Grapes', 'Orange', 'Blue Berries'])
fruits

Apple              Red
Grapes           Green
Orange          Orange
Blue Berries      Blue
dtype: object

In [10]:
fruits['Grapes']

'Green'

In [12]:
fruits['Grapes'] = ' Black'
fruits

Apple              Red
Grapes           Black
Orange          Orange
Blue Berries      Blue
dtype: object

In [16]:
#passing a list of indexes
fruits[['Orange', 'Blue Berries']]

Orange          Orange
Blue Berries      Blue
dtype: object

In [26]:
numbers = pd.Series([10, 20, 30, 40, 50], index = ['ten', 'twenty', 'thirty', 'forty', 'fifty'])
numbers

ten       10
twenty    20
thirty    30
forty     40
fifty     50
dtype: int64

In [29]:
numbers[numbers.values > 25]

thirty    30
forty     40
fifty     50
dtype: int64

In [39]:
numbers * 3

ten        30
twenty     60
thirty     90
forty     120
fifty     150
dtype: int64

In [38]:
np.square(numbers)
#numbers ** 2

ten        100
twenty     400
thirty     900
forty     1600
fifty     2500
dtype: int64

In [37]:
np.log(numbers)

ten       2.302585
twenty    2.995732
thirty    3.401197
forty     3.688879
fifty     3.912023
dtype: float64

In [40]:
np.exp(numbers)

ten       2.202647e+04
twenty    4.851652e+08
thirty    1.068647e+13
forty     2.353853e+17
fifty     5.184706e+21
dtype: float64

In [41]:
# From dictionary
fruits = {'Apple': 'Red', 'Mango': 'Orange', 'Blue Berries': 'Blue'}
pd_fruits = pd.Series(fruits)
pd_fruits

Apple              Red
Mango           Orange
Blue Berries      Blue
dtype: object

In [42]:
pd_fruits.values

array(['Red', 'Orange', 'Blue'], dtype=object)

In [43]:
pd_fruits.index

Index(['Apple', 'Mango', 'Blue Berries'], dtype='object')

In [45]:
'kiwi' in pd_fruits

False

In [46]:
'Apple' in pd_fruits #Operational on indexes

True

In [47]:
'Red' in pd_fruits # not operational on values

False

In [48]:
'Red' in pd_fruits.values

True

In [49]:
english = pd.Series([10, 23, 30, 43, 50], index = ['Ram', 'Shyam', 'Ganesh', 'Raju', 'John'])
english

Ram       10
Shyam     23
Ganesh    30
Raju      43
John      50
dtype: int64

In [50]:
maths = pd.Series([11, 25, 50, 43, 30], index = ['Ram', 'John', 'Ganesh', 'Raju', 'Shyam'])
maths

Ram       11
John      25
Ganesh    50
Raju      43
Shyam     30
dtype: int64

In [51]:
total = english + maths

In [52]:
total

Ganesh    80
John      75
Raju      86
Ram       21
Shyam     53
dtype: int64

In [53]:
maths = pd.Series([11, 25, 50, 43, 30], index = ['Ram', 'Rishi', 'Ganesh', 'Raju', 'Shyam'])
total = english + maths
total

Ganesh    80.0
John       NaN
Raju      86.0
Ram       21.0
Rishi      NaN
Shyam     53.0
dtype: float64

In [54]:
total.isnull()

Ganesh    False
John       True
Raju      False
Ram       False
Rishi      True
Shyam     False
dtype: bool

In [55]:
total.notnull()

Ganesh     True
John      False
Raju       True
Ram        True
Rishi     False
Shyam      True
dtype: bool

In [56]:
total[total.notnull()]

Ganesh    80.0
Raju      86.0
Ram       21.0
Shyam     53.0
dtype: float64

In [59]:
marks = {'Maths' : [10, 20, 30, 40, 50],
        'English': [50, 60, 70, 80],
        'History': [25, 35, 45, 55, 65]}
marks

{'Maths': [10, 20, 30, 40, 50],
 'English': [50, 60, 70, 80],
 'History': [25, 35, 45, 55, 65]}

In [60]:
marks = pd.DataFrame(marks)
marks

ValueError: arrays must all be same length

In [62]:
marks = {'Maths' : [10, 20, 30, 40, 50],
        'English': [50, 60, 70, 80, 90],
        'History': [25, 35, 45, 55, 65]}

marks = pd.DataFrame(marks)
marks

   Maths  English  History
0     10       50       25
1     20       60       35
2     30       70       45
3     40       80       55
4     50       90       65

In [63]:
marks = pd.DataFrame(marks, columns = ['History', 'Maths', 'English'])
marks

   History  Maths  English
0       25     10       50
1       35     20       60
2       45     30       70
3       55     40       80
4       65     50       90

In [64]:
marks = pd.DataFrame(marks, columns = ['History', 'Maths', 'English', 'Science'])
marks

   History  Maths  English  Science
0       25     10       50      NaN
1       35     20       60      NaN
2       45     30       70      NaN
3       55     40       80      NaN
4       65     50       90      NaN

In [65]:
marks['Maths'] #Dict like notation

0    10
1    20
2    30
3    40
4    50
Name: Maths, dtype: int64

In [67]:
marks.Maths #Attribue like notation

0    10
1    20
2    30
3    40
4    50
Name: Maths, dtype: int64

In [68]:
marks.Science = 15
marks

   History  Maths  English  Science
0       25     10       50       15
1       35     20       60       15
2       45     30       70       15
3       55     40       80       15
4       65     50       90       15

In [71]:
marks.History = np.random.randn(5)*10
marks

     History  Maths  English  Science
0   5.944147     10       50       15
1  -5.109602     20       60       15
2   0.223722     30       70       15
3 -11.899064     40       80       15
4  13.256990     50       90       15

In [72]:
chemistry = pd.Series([10, 20, 30, 40, 50], index = [1, 2, 3, 4, 5])
chemistry

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [73]:
marks.Chemistry = chemistry
marks

<ipython-input-73-d006ed8e1bb9>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  marks.Chemistry = chemistry

     History  Maths  English  Science
0   5.944147     10       50       15
1  -5.109602     20       60       15
2   0.223722     30       70       15
3 -11.899064     40       80       15
4  13.256990     50       90       15

In [74]:
marks['Chemistry'] = chemistry
marks

     History  Maths  English  Science  Chemistry
0   5.944147     10       50       15        NaN
1  -5.109602     20       60       15       10.0
2   0.223722     30       70       15       20.0
3 -11.899064     40       80       15       30.0
4  13.256990     50       90       15       40.0

In [76]:
#DF using ND-Array
array1 = np.arange(25).reshape(5, 5)
array1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [78]:
list('ABCDE')

['A', 'B', 'C', 'D', 'E']

In [80]:
pd.DataFrame(array1, index = ['Mon', 'Tues', 'Wed', 'Thurs', 'Friday'], columns = list('ABCDE'))

         A   B   C   D   E
Mon      0   1   2   3   4
Tues     5   6   7   8   9
Wed     10  11  12  13  14
Thurs   15  16  17  18  19
Friday  20  21  22  23  24

In [82]:
!cat data/sample_data.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [83]:
df = pd.read_csv("data/sample_data.csv")
df

  Unnamed: 0 state  color    food  age  height  score
0       Jane    NY   blue   Steak   30     165    4.6
1       Niko    TX  green    Lamb    2      70    8.3
2      Aaron    FL    red   Mango   12     120    9.0
3   Penelope    AL  white   Apple    4      80    3.3
4       Dean    AK   gray  Cheese   32     180    1.8
5  Christina    TX  black   Melon   33     172    9.5
6   Cornelia    TX    red   Beans   69     150    2.2

In [85]:
pd.read_table("data/sample_data.csv", delimiter=',')

  Unnamed: 0 state  color    food  age  height  score
0       Jane    NY   blue   Steak   30     165    4.6
1       Niko    TX  green    Lamb    2      70    8.3
2      Aaron    FL    red   Mango   12     120    9.0
3   Penelope    AL  white   Apple    4      80    3.3
4       Dean    AK   gray  Cheese   32     180    1.8
5  Christina    TX  black   Melon   33     172    9.5
6   Cornelia    TX    red   Beans   69     150    2.2

In [86]:
pd.read_csv("data/sample_data.csv", header = None)

           0      1      2       3    4       5      6
0        NaN  state  color    food  age  height  score
1       Jane     NY   blue   Steak   30     165    4.6
2       Niko     TX  green    Lamb    2      70    8.3
3      Aaron     FL    red   Mango   12     120    9.0
4   Penelope     AL  white   Apple    4      80    3.3
5       Dean     AK   gray  Cheese   32     180    1.8
6  Christina     TX  black   Melon   33     172    9.5
7   Cornelia     TX    red   Beans   69     150    2.2